#  Все переменные взяты из задач курса "24 задачи"
# Возможно, они сейчас уже изменились, поэтому в описаниях я привожу названия задач


# 1. Задача о зарплатах

sortlist(x) - buble_sort_list(list_of_items):
# название функции, сортирующей список и самого списка

# 2. Задача о взломе мобильных телефонов
small - small_steps
big - big_steps
# Описывaемые сушности - это кортежи со всеми возможными шагами длиной 1 (по горизотали и вертикали)
# и длиной 1.414213 (корень из 2) - о дигонали

# 3. Задача о шифровании и "Кроличьй лапке"
S - list_of_letters     # преобразование входной строки в список из символов

# 4.Задача о шифровании и "Кроличьй лапке"
res - encrypted_list_of_letters  # промежуточный результат - список символов в нужном порядке

# 5. Задача о шифровании и "Кроличьй лапке"
result1 - encrypted_text  # результат шифрования - зашифрованный текст сообщения

# 6. Задача "Разность длинных чисел"
bol - reduced_number
men - subtracted_number
res - difference
# Представления уменьшаемого, вычитаемого и разности

# 6. Задача о захвате Государства Квадратов
D - day_of_operation    # порядковый номер очередного дня операции
C - free_territories    # наличие незахваченных территорий

# 7. Задача о шифровании сигналов НЛО 
S - number_to_convert   # очередное число которое нужно перобразовать

# 8. задача о Яндекс-такси и светофорах
t - time_counter        # счетчик времени

# 9. Задача об экономии тонера
N - current_symbol_cost     # стоимость печати очередного символа
S - cost_of_printing        # стоимость печати всей строки

# 10. Задача о поиске слова в тексте
S2 - words      # список слов

# 11. Задача о выборах и 146%
Copy - sorted_votes         # отсортированный список результатов голосования

# 12. Задача об отчетности по продажам
S - sales_positions     # преобразованый список позиций продаж

